{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "MocopiLiveLinkModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Create Mocopi Source"
					},
					"Translation":
					{
						"Text": "Create Mocopi Source"
					},
					"Key": "CreateSourceButtonLabel"
				},
				{
					"Source":
					{
						"Text": "Creates a connection to Mocopi Sensors"
					},
					"Translation":
					{
						"Text": "Creates a connection to Mocopi Sensors"
					},
					"Key": "SourceTooltip"
				},
				{
					"Source":
					{
						"Text": "Enter a subject name to create a Mocopi LiveLink Source"
					},
					"Translation":
					{
						"Text": "Enter a subject name to create a Mocopi LiveLink Source"
					},
					"Key": "errorNoSubjectName"
				},
				{
					"Source":
					{
						"Text": "Error loading the mocopiMotionFormat Library. Please reinstall the plugin to repair the files."
					},
					"Translation":
					{
						"Text": "Error loading the mocopiMotionFormat Library. Please reinstall the plugin to repair the files."
					},
					"Key": "errorInvalidMMF"
				},
				{
					"Source":
					{
						"Text": "Error: Empty Subject Name"
					},
					"Translation":
					{
						"Text": "Error: Empty Subject Name"
					},
					"Key": "errorTitleNoSubjectName"
				},
				{
					"Source":
					{
						"Text": "Error: Invalid Port"
					},
					"Translation":
					{
						"Text": "Error: Invalid Port"
					},
					"Key": "errorTitleInvalidPort"
				},
				{
					"Source":
					{
						"Text": "Error: Port in Use"
					},
					"Translation":
					{
						"Text": "Error: Port in Use"
					},
					"Key": "errorTitleUsedPort"
				},
				{
					"Source":
					{
						"Text": "Error: mocopiMotionFormat Library"
					},
					"Translation":
					{
						"Text": "Error: mocopiMotionFormat Library"
					},
					"Key": "errorTitleInvalidMMF"
				},
				{
					"Source":
					{
						"Text": "Failed to import mocopiMotionFormat function"
					},
					"Translation":
					{
						"Text": "Failed to import mocopiMotionFormat function"
					},
					"Key": "MMFImportError"
				},
				{
					"Source":
					{
						"Text": "Failed to load the required mocopiMotionFormat library. Plugin will not be functional. File Path: "
					},
					"Translation":
					{
						"Text": "Failed to load the required mocopiMotionFormat library. Plugin will not be functional. File Path: "
					},
					"Key": "MMFLoadError"
				},
				{
					"Source":
					{
						"Text": "Invalid port.\nPlease enter a port number between 0 and 65535"
					},
					"Translation":
					{
						"Text": "Invalid port.\nPlease enter a port number between 0 and 65535"
					},
					"Key": "errorInvalidPort"
				},
				{
					"Source":
					{
						"Text": "Listening to port {0}"
					},
					"Translation":
					{
						"Text": "Listening to port {0}"
					},
					"Key": "SourceStatusReceiving"
				},
				{
					"Source":
					{
						"Text": "Mocopi LiveLink"
					},
					"Translation":
					{
						"Text": "Mocopi LiveLink"
					},
					"Key": "sourceMachineName"
				},
				{
					"Source":
					{
						"Text": "Mocopi LiveLink"
					},
					"Translation":
					{
						"Text": "Mocopi LiveLink"
					},
					"Key": "sourceType"
				},
				{
					"Source":
					{
						"Text": "Mocopi LiveLink"
					},
					"Translation":
					{
						"Text": "Mocopi LiveLink"
					},
					"Key": "SourceDisplayName"
				},
				{
					"Source":
					{
						"Text": "MocopiLiveLink plugin received unrecognized data"
					},
					"Translation":
					{
						"Text": "MocopiLiveLink plugin received unrecognized data"
					},
					"Key": "receivedUnrecognizedData"
				},
				{
					"Source":
					{
						"Text": "Port Number"
					},
					"Translation":
					{
						"Text": "Port Number"
					},
					"Key": "InputPort"
				},
				{
					"Source":
					{
						"Text": "Socket Initialization Failed"
					},
					"Translation":
					{
						"Text": "Socket Initialization Failed"
					},
					"Key": "socketInitFailed"
				},
				{
					"Source":
					{
						"Text": "Subject Name"
					},
					"Translation":
					{
						"Text": "Subject Name"
					},
					"Key": "SubjectName"
				},
				{
					"Source":
					{
						"Text": "This port is already being used by another Mocopi LiveLink Source"
					},
					"Translation":
					{
						"Text": "This port is already being used by another Mocopi LiveLink Source"
					},
					"Key": "errorUsedPort"
				},
				{
					"Source":
					{
						"Text": "Trying to start UDP thread with an invalid / uninitialized socket"
					},
					"Translation":
					{
						"Text": "Trying to start UDP thread with an invalid / uninitialized socket"
					},
					"Key": "errorInvalidSocket"
				}
			]
		}
	]
}